package days02;

/**
 * @author minseok
 * @date 2023. 7. 14. - 오후 3:15:45
 * @subject 음수 표현
 * @content 정수의 진법변환    /2
 *                실수의 진법변환   *2
 */
public class Ex13 {
	public static void main(String[] args) {
		//음수는 2의 보수법 
		// 1. 음수 절대치를 구한다 [-10] => 10 ( 00001010)
		// 2. 보수 ( 11110101) 0과 1을 바꿔준다
		// 3. 1더한다. ( 11110110) 0에는 1이 들어가고 1은 다음수로 올라가 0이된다
	
		//0.625 * 2 =[1].25
		//0.25  * 2  =[0].5
		//0.5    * 2  =[1].0
		
		//0.625 실수 - > 0.101(2)		
		

	}//main
}//class
